In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [29]:
# A simple data frame
df = DataFrame({'city':['Beijing','Shanghai','Tokyo','New York','Mumbai','Bangkok','Seoul'],'food':['duck','baozi','sushi','burger','banana','banana','kimchi'],
                    'index':[1,2,3,4,5,6,7]},columns=['city','food'])

In [30]:
df

       city    food
0   Beijing    duck
1  Shanghai   baozi
2     Tokyo   sushi
3  New York  burger
4    Mumbai  banana
5   Bangkok  banana
6     Seoul  kimchi

In [31]:
# Add column for these city states
Country={'Beijing':'China','Shanghai':'China','Tokyo':'Japan','New York':'US','Mumbai':'India','Bangkok':'Tailand','Seoul':'Korean'}

In [32]:
df['Country']=df['city'].map(Country)

In [33]:
df

       city    food  Country
0   Beijing    duck    China
1  Shanghai   baozi    China
2     Tokyo   sushi    Japan
3  New York  burger       US
4    Mumbai  banana    India
5   Bangkok  banana  Tailand
6     Seoul  kimchi   Korean

### What about this ?

In [34]:
# Create a dframe to work with
df = DataFrame({'city':['Beijing','Shanghai','Tokyo','New York','Mumbai','Bangkok','Seoul','beijing','mumbai'],
                    'index':[1,2,3,4,5,6,7,8,9]},columns=['index','city'])

In [35]:
df

   index      city
0      1   Beijing
1      2  Shanghai
2      3     Tokyo
3      4  New York
4      5    Mumbai
5      6   Bangkok
6      7     Seoul
7      8   beijing
8      9    mumbai

In [36]:
# Add column for these city states
Country={'Beijing':'China','Shanghai':'China','Tokyo':'Japan','New York':'US','Mumbai':'India','Bangkok':'Tailand','Seoul':'Korean'}

In [37]:
# Map the column we just created to our original dataframe
df['Country'] = df['city'].map(lambda x: Country[x.title()])

In [42]:
df.city[8].title()

'Mumbai'

In [43]:
df

   index      city  Country
0      1   Beijing    China
1      2  Shanghai    China
2      3     Tokyo    Japan
3      4  New York       US
4      5    Mumbai    India
5      6   Bangkok  Tailand
6      7     Seoul   Korean
7      8   beijing    China
8      9    mumbai    India